In [1]:
# DEVOIR 2 - QUESTION 2
# PARTIE A: NETTOYAGE DES DONNÉES
import csv
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("CSV Raw Data/33.csv")
df.head()

        Country   Men  Women  Average  Age Gap  Age Ratio  Year Source
0       Algeria  33.5   27.8     30.7      5.7       1.21  2006    [2]
1        Angola  24.7   21.4     23.1      3.3       1.15  2001    [3]
2         Benin  23.8   18.7     21.3      5.1       1.27  2006    [3]
3      Botswana  30.9   26.4     28.7      4.5       1.17  2001    [4]
4  Burkina Faso  24.3   17.9     21.1      6.4       1.36  2010    [3]

In [3]:
df = df.iloc[0:,[0,2]]
df

             Country  Women
0            Algeria   27.8
1             Angola   21.4
2              Benin   18.7
3           Botswana   26.4
4       Burkina Faso   17.9
..               ...    ...
190            Samoa   24.1
191  Solomon Islands   20.3
192            Tonga   23.6
193           Tuvalu   22.1
194          Vanuatu   20.8

[195 rows x 2 columns]

In [4]:
df.iloc[:,-1].count()

195